<details>
<summary>Execution result of "run-all plan" in "infrastructure/aws"</summary>

```terraform
17:20:59.764 INFO   The stack at /github/workspace/infrastructure/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_accounts/playground
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc
- Module playground/north-virginia/vpc


17:20:59.902 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/management/north-virginia/vpc/.terragrunt-cache/tN8aN2Wrm1ax0JOoNGxYDj4UZc8/A35GeYiqYDYXDWZftKtd1kkU5ic
17:20:59.915 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/infrastructure/aws/management/north-virginia/aws_organization/.terragrunt-cache/BmOb26uR7vqlaJoMBL_XANu2c6k/kLn2nKw80j_MBMKRZUlBCyiMAms
17:20:59.916 INFO   [playground/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/playground/north-virginia/vpc/.terragrunt-cache/_n5IKqt3mrmwcd0qdbmFt6RLz1g/A35GeYiqYDYXDWZftKtd1kkU5ic
17:20:59.921 INFO   [management/north-virginia/aws_accounts/playground] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/playground/.terragrunt-cache/pamcXYsh7Pqpp5BrO4tFjqhSqzs/10o_Yfon3CbB0MLOTJl69oEly1g
17:21:01.435 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing the backend...
17:21:01.435 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
17:21:01.464 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
17:21:02.086 STDOUT [playground/north-virginia/vpc] tofu: Initializing the backend...
17:21:02.427 STDOUT [management/north-virginia/aws_organization] tofu: 
17:21:02.427 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:21:02.427 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
17:21:02.433 STDOUT [management/north-virginia/aws_accounts/playground] tofu: 
17:21:02.433 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:21:02.433 STDOUT [management/north-virginia/aws_accounts/playground] tofu: use this backend unless the backend configuration changes.
17:21:02.445 STDOUT [management/north-virginia/vpc] tofu: 
17:21:02.445 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:21:02.445 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:21:02.919 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
17:21:02.919 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:21:02.925 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing provider plugins...
17:21:02.925 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:21:02.932 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
17:21:02.932 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:21:03.049 STDOUT [playground/north-virginia/vpc] tofu: 
17:21:03.049 STDOUT [playground/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:21:03.049 STDOUT [playground/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:21:03.558 STDOUT [playground/north-virginia/vpc] tofu: Initializing provider plugins...
17:21:03.558 STDOUT [playground/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:21:04.304 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.93.0...
17:21:04.305 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installing hashicorp/aws v5.93.0...
17:21:04.331 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.93.0...
17:21:04.516 STDOUT [playground/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.93.0...
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Providers are signed by their developers.
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: If you'd like to know more about provider signing, you can read about it here:
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: selections it made above. Include this file in your version control repository
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: you run "tofu init" in the future.
17:21:10.720 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has been successfully initialized!
17:21:10.730 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:21:10.731 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
17:21:10.732 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:21:10.802 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:21:10.803 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: Providers are signed by their developers.
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:21:11.333 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:21:17.726 STDOUT [management/north-virginia/aws_organization] tofu: aws_organizations_organization.org: Refreshing state... [id=o-4s1jxdnpu3]
17:21:17.974 STDOUT [management/north-virginia/aws_accounts/playground] tofu: aws_organizations_account.account: Refreshing state... [id=672491114190]
17:21:18.413 STDOUT [management/north-virginia/vpc] tofu: No changes. Your infrastructure matches the configuration.
17:21:18.413 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:21:18.413 STDOUT [management/north-virginia/vpc] tofu: found no differences, so no changes are needed.
17:21:18.674 STDOUT [playground/north-virginia/vpc] tofu: aws_vpc.this[0]: Refreshing state... [id=vpc-09c1bea58bd166510]
17:21:18.883 STDOUT [management/north-virginia/aws_accounts/playground] tofu: No changes. Your infrastructure matches the configuration.
17:21:18.883 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:21:18.883 STDOUT [management/north-virginia/aws_accounts/playground] tofu: found no differences, so no changes are needed.
17:21:18.977 STDOUT [management/north-virginia/aws_organization] tofu: No changes. Your infrastructure matches the configuration.
17:21:18.978 STDOUT [management/north-virginia/aws_organization] tofu: 
17:21:18.978 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:21:18.978 STDOUT [management/north-virginia/aws_organization] tofu: found no differences, so no changes are needed.
17:21:19.839 STDOUT [playground/north-virginia/vpc] tofu: aws_default_security_group.this[0]: Refreshing state... [id=sg-075239a0c7cde2763]
17:21:19.841 STDOUT [playground/north-virginia/vpc] tofu: aws_default_route_table.default[0]: Refreshing state... [id=rtb-00224af6a5ce2b957]
17:21:19.872 STDOUT [playground/north-virginia/vpc] tofu: aws_route_table.public[0]: Refreshing state... [id=rtb-0c376a40bb68021aa]
17:21:19.879 STDOUT [playground/north-virginia/vpc] tofu: aws_default_network_acl.this[0]: Refreshing state... [id=acl-082059db9caa856ef]
17:21:19.886 STDOUT [playground/north-virginia/vpc] tofu: aws_internet_gateway.this[0]: Refreshing state... [id=igw-029822ae5aa00de92]
17:21:19.895 STDOUT [playground/north-virginia/vpc] tofu: aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0eda441d160fda743]
17:21:19.901 STDOUT [playground/north-virginia/vpc] tofu: aws_route_table.private[0]: Refreshing state... [id=rtb-06dd125c4c4fe872c]
17:21:19.902 STDOUT [playground/north-virginia/vpc] tofu: aws_route_table.private[2]: Refreshing state... [id=rtb-0cbc468207dfcb5a2]
17:21:19.903 STDOUT [playground/north-virginia/vpc] tofu: aws_route_table.private[1]: Refreshing state... [id=rtb-02b603a4ed961e070]
17:21:20.233 STDOUT [playground/north-virginia/vpc] tofu: aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c376a40bb68021aa1080289494]
17:21:20.234 STDOUT [playground/north-virginia/vpc] tofu: aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a6ad28e8c5dbb6d4]
17:21:20.236 STDOUT [playground/north-virginia/vpc] tofu: aws_eip.nat[1]: Refreshing state... [id=eipalloc-05239d797e16b2149]
17:21:20.237 STDOUT [playground/north-virginia/vpc] tofu: aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ae7fa0ae0bb988d7]
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu used the selected providers to generate the following execution
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu: plan. Resource actions are indicated with the following symbols:
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   + create
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ update in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu will perform the following actions:
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_network_acl.this[0] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_default_network_acl" "this" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                     = "acl-082059db9caa856ef"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                   = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc-default"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all               = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (5 unchanged attributes hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (4 unchanged blocks hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_route_table.default[0] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_default_route_table" "default" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                     = "rtb-00224af6a5ce2b957"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                   = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc-default"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all               = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (6 unchanged attributes hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (1 unchanged block hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_security_group.this[0] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_default_security_group" "this" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                     = "sg-075239a0c7cde2763"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         name                   = "default"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                   = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc-default"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all               = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (7 unchanged attributes hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[0] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_eip" "nat" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                   = "eipalloc-0ae7fa0ae0bb988d7"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                 = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1a" -> "my-vpc-us-east-1a"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all             = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1a" -> "my-vpc-us-east-1a"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (8 unchanged attributes hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[1] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_eip" "nat" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                   = "eipalloc-05239d797e16b2149"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                 = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1b" -> "my-vpc-us-east-1b"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all             = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1b" -> "my-vpc-us-east-1b"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         # (8 unchanged attributes hidden)
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[2] will be updated in-place
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_eip" "nat" {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         id                   = "eipalloc-0a6ad28e8c5dbb6d4"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                 = {
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1c" -> "my-vpc-us-east-1c"
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.811 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all             = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-eu-east-1c" -> "my-vpc-us-east-1c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         # (8 unchanged attributes hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_internet_gateway.this[0] will be updated in-place
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_internet_gateway" "this" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         id       = "igw-029822ae5aa00de92"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags     = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         # (3 unchanged attributes hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[0] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = "eipalloc-0ae7fa0ae0bb988d7"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-us-east-1a"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-us-east-1a"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[1] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = "eipalloc-05239d797e16b2149"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-us-east-1b"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-us-east-1b"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[2] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = "eipalloc-0a6ad28e8c5dbb6d4"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-us-east-1c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-us-east-1c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[0] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = "rtb-06dd125c4c4fe872c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[1] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = "rtb-02b603a4ed961e070"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[2] will be created
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = "rtb-0cbc468207dfcb5a2"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[0] will be updated in-place
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_route_table" "private" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         id               = "rtb-06dd125c4c4fe872c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags             = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1a" -> "my-vpc-private-us-east-1a"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all         = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1a" -> "my-vpc-private-us-east-1a"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         # (5 unchanged attributes hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[1] will be updated in-place
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_route_table" "private" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         id               = "rtb-02b603a4ed961e070"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags             = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1b" -> "my-vpc-private-us-east-1b"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all         = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1b" -> "my-vpc-private-us-east-1b"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         # (5 unchanged attributes hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[2] will be updated in-place
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_route_table" "private" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         id               = "rtb-0cbc468207dfcb5a2"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags             = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1c" -> "my-vpc-private-us-east-1c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all         = {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "Name"        = "my-vpc-private-eu-east-1c" -> "my-vpc-private-us-east-1c"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:             # (4 unchanged elements hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         # (5 unchanged attributes hidden)
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.public[0] will be updated in-place
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_route_table" "public" {
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:         id               = "rtb-0c376a40bb68021aa"
17:21:20.812 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags             = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc-public"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all         = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         # (5 unchanged attributes hidden)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[0] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-06dd125c4c4fe872c"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[1] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-02b603a4ed961e070"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[2] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-0cbc468207dfcb5a2"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[0] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-0c376a40bb68021aa"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[1] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-0c376a40bb68021aa"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[2] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = "rtb-0c376a40bb68021aa"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[0] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.1.0/24"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[1] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1b"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.2.0/24"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-us-east-1b"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-us-east-1b"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[2] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1c"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.3.0/24"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-us-east-1c"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-us-east-1c"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[0] will be created
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.101.0/24"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-us-east-1a"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.813 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[1] will be created
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.102.0/24"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[2] will be created
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "us-east-1c"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.103.0/24"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-us-east-1c"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-us-east-1c"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   # aws_vpc.this[0] will be updated in-place
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_vpc" "this" {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         id                                   = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags                                 = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all                             = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         # (14 unchanged attributes hidden)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   # aws_vpn_gateway.this[0] will be updated in-place
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   ~ resource "aws_vpn_gateway" "this" {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         id              = "vgw-0eda441d160fda743"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags            = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             "Name"        = "my-vpc"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           - "environment" = "management" -> null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       ~ tags_all        = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           ~ "environment" = "management" -> "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             # (5 unchanged elements hidden)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         # (3 unchanged attributes hidden)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu: Plan: 18 to add, 13 to change, 0 to destroy.
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu: 
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu: Changes to Outputs:
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   ~ azs                                         = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       - "eu-east-1a",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       - "eu-east-1b",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       - "eu-east-1c",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + "us-east-1a",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + "us-east-1b",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + "us-east-1c",
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + natgw_ids                                   = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + natgw_interface_ids                         = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + private_route_table_association_ids         = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnet_arns                         = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnet_objects                      = [
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1a"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.1.0/24"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-us-east-1a"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-us-east-1a"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.2.0/24"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-us-east-1b"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1c"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.3.0/24"
17:21:20.814 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-us-east-1c"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-us-east-1c"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnets                             = [
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:   + public_route_table_association_ids          = [
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnet_arns                          = [
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnet_objects                       = [
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1a"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.101.0/24"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-us-east-1a"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-us-east-1a"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1b"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.102.0/24"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-us-east-1b"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-us-east-1b"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "us-east-1c"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.103.0/24"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-us-east-1c"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-us-east-1c"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "playground"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:             }
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = "vpc-09c1bea58bd166510"
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:         },
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnets                              = [
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:21:20.815 STDOUT [playground/north-virginia/vpc] tofu:     ]
```

</details>
    
